yicheng55/esp-idf/examples/ethernet/dm9058_ptp_demo/sdkconfig.defaults
# CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESP_NETIF_L2_TAP=y

CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y

CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y
# DM9058 one-step: disable two-step SYNC (no Follow_Up); MAC sets PTP_ONESTEP + TCR insert
CONFIG_NETUTILS_PTPD_TWOSTEP_SYNC=n

CONFIG_ETH_SPI_ETHERNET_DM9058=y

#
# Example Ethernet Configuration
#
CONFIG_EXAMPLE_USE_SPI_ETHERNET=y
# (MANUAL, SPI_CONFIGURATIONS)
CONFIG_EXAMPLE_SPI_ETHERNETS_NUM=1
CONFIG_EXAMPLE_USE_DM9058=y
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192

# CONFIG_MAIN_TASK_STACK_SIZE=8192
# CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_NETUTILS_PTPD_SEND_DELAYREQ=y
CONFIG_NETUTILS_PTPD_MAX_PATH_DELAY_NS=100000
CONFIG_NETUTILS_PTPD_DELAYREQ_AVGCOUNT=100
# Offset step gate for E2E Delay_Req (4 consecutive syncs). 500 ns is too tight on real links.
CONFIG_NETUTILS_PTPD_PATH_DELAY_STABILITY_NS=500000

# gPTP (IEEE 802.1AS) profile — keep HW + protocol switches in sync.
# Opt in by uncommenting both (or use menuconfig; one defaults to the other
# as long as CONFIG_ETH_SPI_ETHERNET_DM9058=y).
# CONFIG_ETH_DM9058_PTP_TRANSPORT_IEEE_802_1AS=y
# CONFIG_NETUTILS_PTPD_IEEE_802_1AS=y
